s = 4**2015 + 2**2015 - 15 # Число, переписанное из условия
print(bin(s)[2:].count('1')) # Кол-во единиц

'''for x in '0123456789abc': # Значения, которые может принимать х в зависимости от системы счисления
   if (int(f'9{x}ab',13) + int(f'{x}46c',16) - int(f'b7{x}',15))%14==0: # х вставлен внутрь числа ввиде цифры с помощью f'{x}'
       print(x, (int(f'9{x}ab',13) + int(f'{x}46c',16) - int(f'b7{x}',15))/14) #Вывод х и остаток деления выражения на число по условию'''

'''s = abs(3 * 5**1984 - 7 * 25**777 - 11 * 125**666 - 404)
a = []
while s > 0:
    a.append(s % 5)
    s = s // 5
print(a.count(2))'''

'''a =[]
s = 4 * 3125**2019 + 3 * 625**2020 - 2 * 125**2021 + 25**2022 - 4 * 5**2023 - 2024
while s > 0:
    a.append(s % 25)
    s = s // 25'''

'''s = 7 * 512**120 - 6 * 64**100 + 8**210 - 255
print(oct(s)[2:].count('0'))'''

'''for x in '0123456789abcdefghijkl':
    if (int(f'56{x}c20', 22) + int(f'89f{x}2', 22) + int(f'h24{x}k21',22)) % 21 == 0:
        print(x, (int(f'56{x}c20', 22) + int(f'89f{x}2', 22) + int(f'h24{x}k21',22)) / 21)'''

'''for x in '0123456789abc':
    if (int(f'753{x}2',13) + int(f'2{x}173', 13)) % 12 == 0:
        print(x, (int(f'753{x}2',13) + int(f'2{x}173', 13)) / 12)'''

'''s = abs(6 * 343**1156 - 5 * 49**1147 + 4 * 7**1153 - 875)
a  = []
while s > 0:
    a.append(s % 7)
    s = s // 7
print(sum(a))'''

'''for x in '0123456789abcdefghi':
    if (int(f'98{x}79641', 19) + int(f'36{x}14', 19) + int(f'73{x}4', 19)) % 18 == 0:
        print(x, (int(f'98{x}79641', 19) + int(f'36{x}14', 19) + int(f'73{x}4', 19)) / 18)'''

'''for x in '0123456789abcdefg':
    if (int(f'12346{x}17', 17) + int(f'7{x}171', 17)) % 16 == 0:
        print(x, (int(f'12346{x}17', 17) + int(f'7{x}171', 17)) / 16)'''

'''for p in range(31,37):
    if int('th',p) + int('nq',p) + int('u', p) == int('1l7',p):
        print(p)'''

'''s = abs(5 * 343**2031 + 4 * 49**2142 - 3 * 7**111 + 7**222)
a =[]
while s > 0:
    a.append(s % 7)
    s = s//7
print(sum(a))
'''